#+OPTIONS: toc:nil

* Quadratic primes

** Task



Starting with the number 1 and moving to the right in a clockwise direction a 5
by 5 spiral is formed as follows:

21 22 23 24 25
20  7  8  9 10
19  6  1  2 11
18  5  4  3 12
17 16 15 14 13

It can be verified that the sum of the numbers on the diagonals is 101.

What is the sum of the numbers on the diagonals in a 1001 by 1001 spiral formed
in the same way?

** Solution

#+BEGIN_SRC python :results output :exports both
total = 0
number = 1
space = 2
space_count = 0

while space <= 1001:
    if space_count == 4:
        space += 2
        space_count = 0

    total += number
    number += space
    space_count += 1

print(total)
#+END_SRC

#+RESULTS:
: 669171001
